;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
;; Doopath packages setup

;; Languages
(package! js2-mode)
(package! python-mode)
(package! typescript-mode)

;; Post-plugins
(package! json-mode)
(package! rjsx-mode)
(package! react-snippets)

;; Utilits
(package! emmet-mode)
(package! evil-easymotion)
